; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (p5 ?x)
               (p2 ?x)
               (p3)
               (p1 ?x)
               (p4 ?x ?y))

  (:action a3
    :parameters (?ob)
    :precondition (and (p5 ?ob) (p2 ?ob) (p3))
    :effect (and (p1 ?ob) (not (p5 ?ob)) (not (p2 ?ob)) 
                 (not (p3))))

  (:action a1
    :parameters  (?ob)
    :precondition (p1 ?ob)
    :effect (and (p5 ?ob) (p3) (p2 ?ob) 
                 (not (p1 ?ob))))

  (:action a4
    :parameters  (?ob ?underob)
    :precondition (and (p5 ?underob) (p1 ?ob))
    :effect (and (p3) (p5 ?ob) (p4 ?ob ?underob)
                 (not (p5 ?underob)) (not (p1 ?ob))))

  (:action a2
    :parameters  (?ob ?underob)
    :precondition (and (p4 ?ob ?underob) (p5 ?ob) (p3))
    :effect (and (p1 ?ob) (p5 ?underob)
                 (not (p4 ?ob ?underob)) (not (p5 ?ob)) (not (p3)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects o3 o2 o1 o5 o4 o6 )
(:init
(p3)
(p2 o3)
(p4 o2 o3)
(p4 o1 o4)
(p4 o5 o1)
(p4 o4 o6)
(p4 o6 o2)
(p5 o5)
)
(:goal
(and
(p4 o3 o4)
(p2 o2)
(p4 o1 o6)
(p4 o5 o1)
(p2 o4)
(p4 o6 o3))
)

(:constraints
  (sometime-before (p2 o2) (p4 o3 o4))
)
)

; plan
1. (a2 o5 o1)
   deleted: (p4 o5 o1) (p5 o5) (p3)
   added: (p1 o5) (p5 o1)
   goals met: 0 of 6
2. (a1 o5)
   deleted: (p1 o5)
   added: (p5 o5) (p3) (p2 o5)
   goals met: 0 of 6
3. (a2 o1 o4)
   deleted: (p4 o1 o4) (p5 o1) (p3)
   added: (p1 o1) (p5 o4)
   goals met: 0 of 6
4. (a1 o1)
   deleted: (p1 o1)
   added: (p5 o1) (p3) (p2 o1)
   goals met: 0 of 6
5. (a2 o4 o6)
   deleted: (p4 o4 o6) (p5 o4) (p3)
   added: (p1 o4) (p5 o6)
   goals met: 0 of 6
6. (a1 o4)
   deleted: (p1 o4)
   added: (p5 o4) (p3) (p2 o4)
   goals met: 1 of 6
7. (a3 o5)
   deleted: (p5 o5) (p2 o5) (p3)
   added: (p1 o5)
   goals met: 1 of 6
8. (a4 o5 o1)
   deleted: (p5 o1) (p1 o5)
   added: (p3) (p5 o5) (p4 o5 o1)
   goals met: 2 of 6
9. (a2 o6 o2)
   deleted: (p4 o6 o2) (p5 o6) (p3)
   added: (p1 o6) (p5 o2)
   goals met: 2 of 6
10. (a1 o6)
   deleted: (p1 o6)
   added: (p5 o6) (p3) (p2 o6)
   goals met: 2 of 6
11. (a2 o2 o3)
   deleted: (p4 o2 o3) (p5 o2) (p3)
   added: (p1 o2) (p5 o3)
   goals met: 2 of 6
12. (a4 o2 o5)
   deleted: (p5 o5) (p1 o2)
   added: (p3) (p5 o2) (p4 o2 o5)
   goals met: 2 of 6
13. (a3 o3)
   deleted: (p5 o3) (p2 o3) (p3)
   added: (p1 o3)
   goals met: 2 of 6
14. (a4 o3 o4)
   deleted: (p5 o4) (p1 o3)
   added: (p3) (p5 o3) (p4 o3 o4)
   goals met: 3 of 6
15. (a2 o2 o5)
   deleted: (p4 o2 o5) (p5 o2) (p3)
   added: (p1 o2) (p5 o5)
   goals met: 3 of 6
16. (a1 o2)
   deleted: (p1 o2)
   added: (p5 o2) (p3) (p2 o2)
   goals met: 4 of 6
17. (a3 o6)
   deleted: (p5 o6) (p2 o6) (p3)
   added: (p1 o6)
   goals met: 4 of 6
18. (a4 o6 o3)
   deleted: (p5 o3) (p1 o6)
   added: (p3) (p5 o6) (p4 o6 o3)
   goals met: 5 of 6
19. (a2 o5 o1)
   deleted: (p4 o5 o1) (p5 o5) (p3)
   added: (p1 o5) (p5 o1)
   goals met: 4 of 6
20. (a1 o5)
   deleted: (p1 o5)
   added: (p5 o5) (p3) (p2 o5)
   goals met: 4 of 6
21. (a3 o1)
   deleted: (p5 o1) (p2 o1) (p3)
   added: (p1 o1)
   goals met: 4 of 6
22. (a4 o1 o6)
   deleted: (p5 o6) (p1 o1)
   added: (p3) (p5 o1) (p4 o1 o6)
   goals met: 5 of 6
23. (a3 o5)
   deleted: (p5 o5) (p2 o5) (p3)
   added: (p1 o5)
   goals met: 5 of 6
24. (a4 o5 o1)
   deleted: (p5 o1) (p1 o5)
   added: (p3) (p5 o5) (p4 o5 o1)
   goals met: 6 of 6
